Autodesk.Revit.DB.LayoutRuleFixedNumber.NumberOfLines
Get or set the number of the beams in a beam system.
Remarks: The number must be positive.

Autodesk.Revit.DB.LayoutRuleFixedNumber.#ctor(System.Int32)
Constructor of LayoutRuleFixedNumber.
numberOfLines:  The value of numberOfLines must be positive.
Remarks: Create a LayoutRuleFixedNumber object with the number of the beams and this number must be positive.

Autodesk.Revit.DB.LayoutRuleFixedNumber
This class indicate the layout rule of a Beam System is Fixed-Number.
Remarks: To use this type of LayoutRule, only the number of the beams must be set.